-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- 생성 시간: 19-07-14 04:56
-- 서버 버전: 5.7.23
-- PHP 버전: 7.1.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `bebemamma`
--
CREATE DATABASE IF NOT EXISTS `bebemamma` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `bebemamma`;

-- --------------------------------------------------------

--
-- 테이블 구조 `babymeal`
--

DROP TABLE IF EXISTS `babymeal`;
CREATE TABLE IF NOT EXISTS `babymeal` (
  `product_id` int(10) NOT NULL,
  `product` varchar(15) NOT NULL,
  `brand` varchar(10) NOT NULL,
  `ingre1` varchar(10) NOT NULL,
  `ingre2` varchar(10) NOT NULL,
  `ingre3` varchar(10) NOT NULL,
  `ingre4` varchar(10) NOT NULL,
  `ingre5` varchar(10) NOT NULL,
  `ingre6` varchar(10) NOT NULL,
  `ingre7` varchar(10) NOT NULL,
  `ingre8` varchar(10) NOT NULL,
  `ingre9` varchar(10) NOT NULL,
  `ingre10` varchar(10) NOT NULL,
  `ingre11` varchar(10) NOT NULL,
  `image` varchar(50) NOT NULL,
  PRIMARY KEY (`product_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='what baby can eat as a meal';

--
-- 테이블의 덤프 데이터 `babymeal`
--

INSERT INTO `babymeal` (`product_id`, `product`, `brand`, `ingre1`, `ingre2`, `ingre3`, `ingre4`, `ingre5`, `ingre6`, `ingre7`, `ingre8`, `ingre9`, `ingre10`, `ingre11`, `image`) VALUES
(1, '흑미미음', '베베쿡', '정제수', '쌀가루', '흑미가루', '', '', '', '', '', '', '', '', ''),
(2, '쌀미음', '베베쿡', '정제수', '쌀가루', '', '', '', '', '', '', '', '', '', ''),
(3, '단호박미음', '베베쿡', '정제수', '쌀가루', '단호박', '', '', '', '', '', '', '', '', ''),
(4, '브로콜리미음', '베베쿡', '정제수', '쌀가루', '브로콜리', '', '', '', '', '', '', '', '', ''),
(5, '고구마미음', '베베쿡', '정제수', '쌀가루', '고구마', '', '', '', '', '', '', '', '', ''),
(6, '감자미음', '베베쿡', '정제수', '쌀가루', '감자', '', '', '', '', '', '', '', '', ''),
(7, '애호박미음', '베베쿡', '정제수', '쌀가루', '애호박', '', '', '', '', '', '', '', '', ''),
(8, '한우얼갈이배추죽', '베베쿡', '정제수', '쌀가루', '한우', '얼갈이배추', '', '', '', '', '', '', '', ''),
(9, '단호박브로컬리죽', '베베쿡', '정제수', '쌀가루', '단호박', '브로콜리', '', '', '', '', '', '', '', ''),
(10, '호박닭살죽', '베베쿡', '정제수', '쌀가루', '애호박', '닭가슴살', '분유', '', '', '', '', '', '', ''),
(11, '사과감자죽', '베베쿡', '정제수', '쌀가루', '감자', '사과', '', '', '', '', '', '', '', ''),
(12, '양배추한우죽', '베베쿡', '정제수', '쌀가루', '양배추', '한우', '', '', '', '', '', '', '', ''),
(13, '한우로메인죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '야채육수', '한우', '로메인', '쥬키니', '양파', '', '', '', ''),
(14, '순두부새송이죽', '베베쿡', '정제수', '쌀', '야채육수', '순두부', '새송이버섯', '비타민채', '', '', '', '', '', ''),
(15, '한우버섯죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '야채육수', '애호박', '한우', '감자', '새송이버섯', '팽이버섯', '양파', '뽕잎분말', ''),
(16, '닭살애호박죽', '베베쿡', '정제수', '쌀', '야채육수', '닭가슴살', '쥬키니', '애호박', '분유', '', '', '', '', ''),
(17, '한우감자시금치죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '야채육수', '한우', '감자', '시금치', '뽕잎분말', '', '', '', ''),
(18, '한우야채죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '야채육수', '한우', '애호박', '양배추', '당근', '양파', '뽕잎분말', '', ''),
(19, '잔멸치무죽', '베베쿡', '정제수', '쌀', '야채육수', '무', '시금치', '잔멸치', '', '', '', '', '', ''),
(20, '한우양배추죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '야채육수', '한우', '양배추', '양파', '뽕잎분말', '', '', '', ''),
(21, '브로콜리단호박죽', '베베쿡', '정제수', '쌀', '단호박', '고구마', '브로콜리', '', '', '', '', '', '', ''),
(22, '한우와야채영양죽', '베베쿡', '정제수', '쌀', '한우', '쥬키니', '당근', '브로콜리', '양파', '뽕잎분말', '', '', '', ''),
(23, '한우청경채죽', '베베쿡', '정제수', '쌀', '한우', '야채육수', '쇠고기육수', '청경채', '얼갈이배추', '양파', '', '', '', ''),
(24, '단호박어린잎채소죽', '베베쿡', '정제수', '쌀', '쇠고기육수', '쌀', '단호박', '비타민채', '당근', '청경채', '로메인', '뽕잎분말', '', ''),
(25, '배즙한우죽', '베베쿡', '정제수', '쌀', '한우', '야채육수', '쇠고기육수', '배', '청경채', '양배추', '뽕잎분말', '', '', ''),
(26, '한우대추찹쌀죽', '베베쿡', '정제수', '쌀', '한우', '야채육수', '쇠고기육수', '늙은호박', '찹쌀', '건대추', '', '', '', ''),
(27, '두부야채죽', '베베쿡', '정제수', '쌀', '순두부', '얼갈이배추', '애호박', '볶음콩가루', '뽕잎분말', '', '', '', '', ''),
(28, '한우청경채죽', '베베쿡', '정제수', '쌀', '한우', '야채육수', '쇠고기육수', '청경채', '얼갈이배추', '양파', '', '', '', ''),
(29, '닭살배추진밥', '베베쿡', '정제수', '쌀', '닭가슴살', '야채육수', '배추', '무', '찹쌀', '양파', '분유', '다시마가루', '양파가루', ''),
(30, '시금치치즈섞음밥', '베베쿡', '정제수', '쌀', '애호박', '시금치', '찹쌀', '당근', '양파', '치즈', '양파가루', '', '', ''),
(31, '한우대추찹쌀죽', '베베쿡', '정제수', '쌀', '한우', '야채육수', '쇠고기육수', '늙은호박', '찹쌀', '건대추', '', '', '', ''),
(32, '삼색야채무른밥', '베베쿡', '정제수', '쌀', '야채육수', '단호박', '당근', '감자', '찹쌀', '비타민채', '양파', '참기름 ', '뽕잎분말', ''),
(33, '한우아스파라거스진밥', '베베쿡', '정제수', '쌀', '야채육수', '한우', '새송이버섯', '찹쌀', '당근', '양파', '아스파라거스', '다진마늘', '생강즙', ''),
(34, '닭살들깨가루진밥', '베베쿡', '정제수', '쌀', '야채육수', '닭가슴살', '애호박', '새송이버섯', '찹쌀', '청경채', '양파', '다진마늘', '생강즙', ''),
(35, '시금치치즈섞음밥', '베베쿡', '정제수', '쌀', '애호박', '시금치', '찹쌀', '당근', '양파', '치즈', '양파가루', '', '', ''),
(36, '한우영양솥밥', '베베쿡', '정제수', '쌀', '한우', '야채육수', '찹쌀', '양송이버섯', '밤', '다진마늘', '생강즙', '참기름', '', ''),
(37, '연어야채볶음밥', '베베쿡', '정제수', '쌀', '감자', '연어', '쥬키니', '당근', '찹쌀', '파슬리분말', '다진마늘', '생강즙', '양파', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `ingreinfo`
--

DROP TABLE IF EXISTS `ingreinfo`;
CREATE TABLE IF NOT EXISTS `ingreinfo` (
  `ingre_id` int(10) NOT NULL,
  `ingre` int(15) NOT NULL,
  `protein` int(1) NOT NULL,
  `calcium` int(1) NOT NULL,
  `iron` int(1) NOT NULL,
  `zinc` int(1) NOT NULL,
  `vitaA` int(1) NOT NULL,
  `vitaB` int(1) NOT NULL,
  `vitaC` int(1) NOT NULL,
  `vitaD` int(1) NOT NULL,
  `vitaE` int(1) NOT NULL,
  `vitaK` int(1) NOT NULL,
  `allergy` int(1) NOT NULL,
  `period` varchar(10) NOT NULL,
  `image` varchar(50) NOT NULL,
  `no1recfood` varchar(10) NOT NULL,
  `no2recfood` varchar(10) NOT NULL,
  `no3recfood` varchar(10) NOT NULL,
  PRIMARY KEY (`ingre_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ingredient in babymeal material';

--
-- 테이블의 덤프 데이터 `ingreinfo`
--

INSERT INTO `ingreinfo` (`ingre_id`, `ingre`, `protein`, `calcium`, `iron`, `zinc`, `vitaA`, `vitaB`, `vitaC`, `vitaD`, `vitaE`, `vitaK`, `allergy`, `period`, `image`, `no1recfood`, `no2recfood`, `no3recfood`) VALUES
(1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 'early', '', '브로콜리배죽', '브로콜리생선죽', ''),
(2, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'early', '', '', '', ''),
(3, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 'early', '', '', '', ''),
(4, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'early', '', '', '', ''),
(5, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', ''),
(6, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 'middle', '', '', '', ''),
(7, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 'middle', '', '', '', ''),
(8, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 'middle', '', '', '', ''),
(9, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 'middle', '', '', '', ''),
(10, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', ''),
(11, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 'middle', '', '', '', ''),
(12, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 'middle', '', '', '', ''),
(13, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 'middle', '', '', '', ''),
(14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'middle', '', '', '', ''),
(15, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 'middle', '', '', '', ''),
(16, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 'middle', '', '', '', ''),
(17, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 'middle', '', '', '', ''),
(18, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 'middle', '', '', '', ''),
(19, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 'middle', '', '', '', ''),
(20, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 'middle', '', '', '', ''),
(21, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 'middle', '', '', '', ''),
(22, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 'middle', '', '', '', ''),
(23, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 'middle', '', '', '', ''),
(24, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', ''),
(25, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 'middle', '', '', '', ''),
(26, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 'middle', '', '', '', ''),
(27, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 'middle', '', '', '', ''),
(28, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'end', '', '', '', ''),
(29, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', ''),
(30, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 'end', '', '', '', ''),
(31, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 'end', '', '', '', ''),
(32, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 'end', '', '', '', ''),
(33, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', ''),
(34, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 'middle', '', '', '', '');

-- --------------------------------------------------------

--
-- 테이블 구조 `meminfo`
--

DROP TABLE IF EXISTS `meminfo`;
CREATE TABLE IF NOT EXISTS `meminfo` (
  `mem_num` int(5) NOT NULL,
  `mem_id` varchar(15) NOT NULL,
  `password` varchar(20) NOT NULL,
  `mem_name` varchar(20) NOT NULL,
  `mem_gender` varchar(1) NOT NULL,
  `baby_name` varchar(20) NOT NULL,
  `baby_gender` varchar(1) NOT NULL,
  `baby_month` int(10) NOT NULL,
  `baby_height` float NOT NULL,
  `baby_weight` float NOT NULL,
  `skinproblem` int(10) NOT NULL,
  `allergy` varchar(100) NOT NULL,
  PRIMARY KEY (`mem_num`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='member information';

--
-- 테이블의 덤프 데이터 `meminfo`
--

INSERT INTO `meminfo` (`mem_num`, `mem_id`, `password`, `mem_name`, `mem_gender`, `baby_name`, `baby_gender`, `baby_month`, `baby_height`, `baby_weight`, `skinproblem`, `allergy`) VALUES
(1, 'p1', '1234', '오병호', 'M', '오주석', 'M', 2, 47.5, 3.3, 1, '땅콩'),
(2, 'p2', '1234', '김주완', 'M', '김노아', 'M', 4, 65.9, 7.58, 0, '계란'),
(3, 'p3', '1234', '권수빈', 'W', '김현정', 'W', 6, 67.4, 8.07, 1, '복숭아'),
(4, 'p4', '1234', '권수지', 'W', '오수진', 'W', 8, 73.51, 7.03, 1, '갑각류'),
(5, 'p5', '1234', '이미나', 'W', '장은빈', 'W', 9, 72.84, 11.26, 1, '우유'),
(6, 'p6', '1234', '김민지', 'W', '김사라', 'W', 10, 74.65, 9.45, 0, '땅콩, 계란'),
(7, 'p7', '1234', '차승훈', 'M', '차승민', 'M', 12, 80.1, 11, 0, '대두'),
(8, 'p8', '1234', '김휘동', 'M', '김짱구', 'M', 15, 87.34, 15.34, 0, '계란, 복숭아, 갑각류'),
(9, 'p9', '1234', '이문혁', 'M', '이다희', 'W', 17, 80.3, 8.21, 1, '땅콩'),
(10, 'p10', '1234', '송가경', 'W', '차현', 'W', 18, 82.6, 11.72, 1, '계란'),
(11, 'p11', '1234', '강세라', 'W', '배타미', 'W', 21, 85.1, 12.3, 1, '복숭아');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
